app/Controllers/Home.php

DELETE FROM `Animes`
WHERE `id` = '11'
---
public function eliminar($id)
{
    $conexion = \Config\Database::connect();
    $conexion->table('Animes')->where('id', $id)->delete();